## Terraform Plan
```
cloudflare_dns_record.dns_records["jellyfin.chaldea.dev"]: Refreshing state... [id=307442fd269f85099852ab1b29eac680]
cloudflare_dns_record.dns_records["status.internal.chaldea.dev"]: Refreshing state... [id=c634999585eaad4595640cf05e242103]
cloudflare_dns_record.dns_records["sabnzbd.internal.chaldea.dev"]: Refreshing state... [id=702ca7d78e11ab8a9129b988e1afa65e]
cloudflare_dns_record.dns_records["push.chaldea.dev"]: Refreshing state... [id=35e6675423cbc38be810002556746e32]
cloudflare_dns_record.dns_records["sonarr.internal.chaldea.dev"]: Refreshing state... [id=8345b3a1776286929ffbd586a63a6be0]
cloudflare_dns_record.dns_records["radarr.internal.chaldea.dev"]: Refreshing state... [id=25315a1e5b5540d3d942809d5b082c65]
cloudflare_dns_record.dns_records["music.chaldea.dev"]: Refreshing state... [id=c83f24c220f7ae9f919b5e695f325b9d]
cloudflare_dns_record.dns_records["pangolin.chaldea.dev"]: Refreshing state... [id=86b079cb6e189df0b7359fa9ad7cf1dd]
cloudflare_dns_record.dns_records["jellyseerr.chaldea.dev"]: Refreshing state... [id=ceeee7642c879d869960ca0f8e55e22f]
cloudflare_dns_record.dns_records["photos.chaldea.dev"]: Refreshing state... [id=fb73e8124bd85255f11257f7dfb5a43f]
cloudflare_dns_record.dns_records["actual.internal.chaldea.dev"]: Refreshing state... [id=5dcd103271d36ddd017a7c03d8cc3e6f]
cloudflare_dns_record.dns_records["papra.internal.chaldea.dev"]: Refreshing state... [id=ffb7f7e89590add84020488c9df6e620]
cloudflare_dns_record.dns_records["vaultwarden.chaldea.dev"]: Refreshing state... [id=a03c347ea478ebccb1cd756ef172f39d]
cloudflare_dns_record.dns_records["dns.internal.chaldea.dev"]: Refreshing state... [id=7d5ed45095f1b57e61f374c2eca964c4]
cloudflare_dns_record.dns_records["chaldea.dev"]: Refreshing state... [id=aba288850d3fe7937374d7b46cd843a8]
cloudflare_dns_record.dns_records["fileflows.internal.chaldea.dev"]: Refreshing state... [id=a6487b35599b8126f917211bd20d612a]
cloudflare_dns_record.dns_records["pdf.chaldea.dev"]: Refreshing state... [id=336bd5267e5f41581eebd26e6f7546ab]
cloudflare_dns_record.dns_records["profilarr.internal.chaldea.dev"]: Refreshing state... [id=2c582cf82648cce705ff8f62652a7f41]
cloudflare_dns_record.dns_records["prowlarr.internal.chaldea.dev"]: Refreshing state... [id=e47d7e11229fecdeed1cb96e0c88c927]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_dns_record.dns_records["jellyseerr.chaldea.dev"] will be destroyed
  # (because key ["jellyseerr.chaldea.dev"] is not in for_each map)
  - resource "cloudflare_dns_record" "dns_records" {
      - content     = "chaldea.dev" -> null
      - created_on  = "2026-02-06T23:43:05Z" -> null
      - id          = "ceeee7642c879d869960ca0f8e55e22f" -> null
      - meta        = jsonencode({})
      - modified_on = "2026-02-06T23:43:05Z" -> null
      - name        = "jellyseerr.chaldea.dev" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - settings    = {
          - flatten_cname = false -> null
        } -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - zone_id     = "763f4223335c61f44d73e6955211152a" -> null
    }

  # cloudflare_dns_record.dns_records["seerr.chaldea.dev"] will be created
  + resource "cloudflare_dns_record" "dns_records" {
      + content          = "chaldea.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "seerr.chaldea.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "763f4223335c61f44d73e6955211152a"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```